[
  {
    "id": "adam-7-23",
    "prophet": {
      "ar": "آدم",
      "en": "Adam",
      "tr": "Âdem"
    },
    "source": {
      "type": "Quran",
      "reference": "7:23"
    },
    "arabic": "قَالَا رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "transliteration": "Rabbana zalamna anfusana wa in lam taghfir lana wa tarhamna lanakunna mina al-khasirin.",
    "english": "Our Lord, we have wronged ourselves. If You do not forgive us and have mercy on us, we will be among the losers.",
    "turkish": "Rabbimiz! Kendimize zulmettik. Bizi bağışlamaz ve bize merhamet etmezsen, kaybedenlerden oluruz.",
    "translation_note": "Paraphrase",
    "topics": [
      "tawbah",
      "forgiveness",
      "mercy"
    ],
    "context": "Adam and Hawwa admitted their mistake and turned to Allah with repentance.",
    "reflection": "True repentance begins with admitting our faults and relying on Allah’s mercy.",
    "sources": [
      "https://quran.com/7/23",
      "https://tanzil.net/#7:23"
    ]
  },
  {
    "id": "nuh-71-28",
    "prophet": {
      "ar": "نوح",
      "en": "Noah",
      "tr": "Nuh"
    },
    "source": {
      "type": "Quran",
      "reference": "71:28"
    },
    "arabic": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا",
    "transliteration": "Rabbi ighfir li wa liwalidayya wa liman dakhala baytiya mu'minan wa lil-mu'minina wal-mu'minat wa la tazid al-zalimin illa tabara.",
    "english": "My Lord, forgive me, my parents, whoever enters my home as a believer, and all believing men and women. Do not increase the wrongdoers except in ruin.",
    "turkish": "Rabbim! Beni, anne babamı, evime mümin olarak girenleri ve tüm mümin erkekleri ile mümin kadınları bağışla; zalimlerin helakini artır.",
    "translation_note": "Paraphrase",
    "topics": [
      "forgiveness",
      "mercy",
      "family"
    ],
    "context": "After long struggle, Nuh prayed for forgiveness for himself, his family, and the believers.",
    "reflection": "It teaches us to seek forgiveness for ourselves and the wider community.",
    "sources": [
      "https://quran.com/71/28",
      "https://tanzil.net/#71:28"
    ]
  },
  {
    "id": "nuh-71-26",
    "prophet": {
      "ar": "نوح",
      "en": "Noah",
      "tr": "Nuh"
    },
    "source": {
      "type": "Quran",
      "reference": "71:26"
    },
    "arabic": "رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا",
    "transliteration": "Rabbi la tadhar 'ala al-ardi mina al-kafirina dayyara.",
    "english": "My Lord, do not leave upon the earth any dwelling of the disbelievers.",
    "turkish": "Rabbim! Yeryüzünde inkârcılardan tek bir kimseyi bırakma.",
    "translation_note": "Paraphrase",
    "topics": [
      "justice",
      "protection"
    ],
    "context": "After persistent rejection, Nuh prayed for justice against those who refused guidance.",
    "reflection": "When oppression persists, we can ask Allah to establish His justice.",
    "sources": [
      "https://quran.com/71/26",
      "https://tanzil.net/#71:26"
    ]
  },
  {
    "id": "nuh-11-47",
    "prophet": {
      "ar": "نوح",
      "en": "Noah",
      "tr": "Nuh"
    },
    "source": {
      "type": "Quran",
      "reference": "11:47"
    },
    "arabic": "قَالَ رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ",
    "transliteration": "Rabbi inni a'udhu bika an as'alaka ma laysa li bihi ilm wa illa taghfir li wa tarhamni akun mina al-khasirin.",
    "english": "My Lord, I seek refuge in You from asking what I have no knowledge of. If You do not forgive me and have mercy on me, I will be among the losers.",
    "turkish": "Rabbim! Bilmediğim şeyi Senden istemekten Sana sığınırım. Beni bağışlamaz ve bana merhamet etmezsen kaybedenlerden olurum.",
    "translation_note": "Paraphrase",
    "topics": [
      "tawbah",
      "forgiveness",
      "mercy"
    ],
    "context": "Nuh humbled himself before Allah after being corrected about his request.",
    "reflection": "We should accept correction from Allah and seek His mercy with humility.",
    "sources": [
      "https://quran.com/11/47",
      "https://tanzil.net/#11:47"
    ]
  },
  {
    "id": "nuh-23-26",
    "prophet": {
      "ar": "نوح",
      "en": "Noah",
      "tr": "Nuh"
    },
    "source": {
      "type": "Quran",
      "reference": "23:26"
    },
    "arabic": "قَالَ رَبِّ انصُرْنِي بِمَا كَذَّبُونِ",
    "transliteration": "Rabbi ansurni bima kadhdhabun.",
    "english": "My Lord, help me because they have denied me.",
    "turkish": "Rabbim! Beni yalanlamalarına karşı bana yardım et.",
    "translation_note": "Paraphrase",
    "topics": [
      "victory",
      "protection"
    ],
    "context": "Nuh asked Allah for support against those who rejected his message.",
    "reflection": "When facing rejection for truth, we can seek Allah’s help and protection.",
    "sources": [
      "https://quran.com/23/26",
      "https://tanzil.net/#23:26"
    ]
  },
  {
    "id": "nuh-23-29",
    "prophet": {
      "ar": "نوح",
      "en": "Noah",
      "tr": "Nuh"
    },
    "source": {
      "type": "Quran",
      "reference": "23:29"
    },
    "arabic": "وَقُل رَّبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ",
    "transliteration": "Rabbi anzilni munzalan mubarakan wa anta khayru al-munzilin.",
    "english": "My Lord, grant me a blessed landing, for You are the best of those who grant landing.",
    "turkish": "Rabbim! Beni bereketli bir menzile indir. Sen indirenlerin en hayırlısısın.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "gratitude"
    ],
    "context": "After the flood, Nuh prayed for a safe and blessed settlement.",
    "reflection": "We should seek Allah’s blessing when beginning a new stage or place.",
    "sources": [
      "https://quran.com/23/29",
      "https://tanzil.net/#23:29"
    ]
  },
  {
    "id": "ibrahim-2-126",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "2:126"
    },
    "arabic": "رَبِّ اجْعَلْ هَٰذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُم بِاللَّهِ وَالْيَوْمِ الْآخِرِ",
    "transliteration": "Rabbi ij'al hadha baladan amina warzuq ahlahu mina al-thamarat man amana minhum billahi wal-yawm al-akhir.",
    "english": "My Lord, make this a secure city and provide its people with fruits—those among them who believe in Allah and the Last Day.",
    "turkish": "Rabbim! Burasını güvenli bir belde yap ve Allah’a ve ahiret gününe iman eden halkını meyvelerle rızıklandır.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "rizq"
    ],
    "context": "Ibrahim prayed for safety and provision for the people of Makkah.",
    "reflection": "Seek both security and lawful provision for our communities.",
    "sources": [
      "https://quran.com/2/126",
      "https://tanzil.net/#2:126"
    ]
  },
  {
    "id": "ibrahim-2-127",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "2:127"
    },
    "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
    "transliteration": "Rabbana taqabbal minna innaka anta al-sami'u al-'alim.",
    "english": "Our Lord, accept from us; indeed, You are the All-Hearing, All-Knowing.",
    "turkish": "Rabbimiz! Bizden kabul buyur; şüphesiz Sen işiten ve bilensin.",
    "translation_note": "Paraphrase",
    "topics": [
      "gratitude",
      "mercy"
    ],
    "context": "Ibrahim and Ismail asked Allah to accept their service while raising the Ka'bah.",
    "reflection": "Righteous acts need Allah’s acceptance more than our pride.",
    "sources": [
      "https://quran.com/2/127",
      "https://tanzil.net/#2:127"
    ]
  },
  {
    "id": "ibrahim-2-128",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "2:128"
    },
    "arabic": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
    "transliteration": "Rabbana waj'alna muslimayni laka wa min dhurriyyatina ummatan muslimatan laka wa arina manasikana wa tub 'alayna innaka anta al-tawwab al-rahim.",
    "english": "Our Lord, make us Muslims devoted to You, and from our descendants a Muslim community. Show us our rites and accept our repentance.",
    "turkish": "Rabbimiz! Bizi Sana teslim olanlardan kıl; soyumuzdan da Sana teslim bir ümmet çıkar. Bize ibadet yollarımızı göster ve tövbemizi kabul et.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "tawbah",
      "family"
    ],
    "context": "Ibrahim and Ismail asked Allah for steadfast submission and guidance for their descendants.",
    "reflection": "We ask Allah to shape our worship and the faith of future generations.",
    "sources": [
      "https://quran.com/2/128",
      "https://tanzil.net/#2:128"
    ]
  },
  {
    "id": "ibrahim-2-129",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "2:129"
    },
    "arabic": "رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِّنْهُمْ يَتْلُوا عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ",
    "transliteration": "Rabbana wab'ath fihim rasulan minhum yatlu 'alayhim ayatika wa yu'allimuhum al-kitab wal-hikmah wa yuzakkihim innaka anta al-'aziz al-hakim.",
    "english": "Our Lord, send among them a messenger who will recite Your verses, teach the Book and wisdom, and purify them.",
    "turkish": "Rabbimiz! Onların arasına kendilerinden bir elçi gönder; ayetlerini okusun, Kitabı ve hikmeti öğretsin, onları arındırsın.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "knowledge"
    ],
    "context": "Ibrahim prayed for a messenger to guide his descendants with revelation.",
    "reflection": "True purification and knowledge come through Allah’s guidance.",
    "sources": [
      "https://quran.com/2/129",
      "https://tanzil.net/#2:129"
    ]
  },
  {
    "id": "ibrahim-14-35",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "14:35"
    },
    "arabic": "رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الْأَصْنَامَ",
    "transliteration": "Rabbi ij'al hadha al-balad amina wajnubni wa baniyya an na'bud al-asnam.",
    "english": "My Lord, make this city secure and keep me and my children away from worshiping idols.",
    "turkish": "Rabbim! Bu beldeyi güvenli kıl; beni ve çocuklarımı putlara tapmaktan uzak tut.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "guidance",
      "family"
    ],
    "context": "Ibrahim prayed for Makkah’s security and protection from idolatry.",
    "reflection": "We ask Allah to safeguard our faith and our families.",
    "sources": [
      "https://quran.com/14/35",
      "https://tanzil.net/#14:35"
    ]
  },
  {
    "id": "ibrahim-14-36",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "14:36"
    },
    "arabic": "رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِّنَ النَّاسِ فَمَن تَبِعَنِي فَإِنَّهُ مِنِّي وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَّحِيمٌ",
    "transliteration": "Rabbi innahunna adlalna kathiran mina al-nas fa man tabi'ani fa innahu minni wa man 'asani fa innaka ghafur rahim.",
    "english": "My Lord, idols have led many people astray. Whoever follows me is of me, and whoever disobeys me—You are forgiving and merciful.",
    "turkish": "Rabbim! Putlar birçok insanı saptırdı. Kim bana uyarsa bendendir; kim bana karşı gelirse, şüphesiz Sen bağışlayan ve merhamet edensin.",
    "translation_note": "Paraphrase",
    "topics": [
      "mercy",
      "guidance"
    ],
    "context": "Ibrahim acknowledged the danger of idols and entrusted people to Allah’s mercy.",
    "reflection": "We depend on Allah’s mercy while urging others toward guidance.",
    "sources": [
      "https://quran.com/14/36",
      "https://tanzil.net/#14:36"
    ]
  },
  {
    "id": "ibrahim-14-37",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "14:37"
    },
    "arabic": "رَبَّنَا إِنِّيٓ أَسْكَنْتُ مِن ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِندَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِّنَ النَّاسِ تَهْوِيٓ إِلَيْهِمْ وَارْزُقْهُم مِّنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ",
    "transliteration": "Rabbana inni askantu min dhurriyyati biwadin ghayri dhi zar'in 'inda baytika al-muharram rabbana liyuqimu al-salah faj'al af'idatan mina al-nas tahwi ilayhim warzuqhum mina al-thamarat la'allahum yashkurun.",
    "english": "Our Lord, I have settled some of my descendants in a barren valley near Your Sacred House so they may establish prayer. Make hearts incline toward them and provide them with fruits so they may be grateful.",
    "turkish": "Rabbimiz! Soyumdan bir kısmını, namazı dosdoğru kılsınlar diye Beyt-i Haram’ın yanında ekinsiz bir vadiye yerleştirdim. İnsanların kalplerini onlara yönelt ve onları meyvelerle rızıklandır ki şükretsinler.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "rizq",
      "gratitude"
    ],
    "context": "Ibrahim placed his family near the Ka'bah and prayed for their worship and provision.",
    "reflection": "Faithful communities need both devotion and Allah’s provision.",
    "sources": [
      "https://quran.com/14/37",
      "https://tanzil.net/#14:37"
    ]
  },
  {
    "id": "ibrahim-14-40",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "14:40"
    },
    "arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
    "transliteration": "Rabbi ij'alni muqima al-salah wa min dhurriyyati rabbana wa taqabbal du'a.",
    "english": "My Lord, make me an establisher of prayer, and from my descendants. Our Lord, accept my supplication.",
    "turkish": "Rabbim! Beni namazı dosdoğru kılanlardan eyle; soyumdan da. Rabbimiz, duamı kabul buyur.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "family",
      "gratitude"
    ],
    "context": "Ibrahim prayed for steadfastness in prayer for himself and his offspring.",
    "reflection": "We seek Allah’s help to remain consistent in worship.",
    "sources": [
      "https://quran.com/14/40",
      "https://tanzil.net/#14:40"
    ]
  },
  {
    "id": "ibrahim-14-41",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "14:41"
    },
    "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "transliteration": "Rabbana ighfir li wa liwalidayya wa lil-mu'minina yawma yaqumu al-hisab.",
    "english": "Our Lord, forgive me, my parents, and the believers on the Day the account is established.",
    "turkish": "Rabbimiz! Hesap görüleceği gün beni, anne babamı ve müminleri bağışla.",
    "translation_note": "Paraphrase",
    "topics": [
      "forgiveness",
      "family",
      "mercy"
    ],
    "context": "Ibrahim sought forgiveness for himself, his parents, and all believers.",
    "reflection": "We should include family and the wider community in our prayers.",
    "sources": [
      "https://quran.com/14/41",
      "https://tanzil.net/#14:41"
    ]
  },
  {
    "id": "ibrahim-26-83",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "26:83"
    },
    "arabic": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
    "transliteration": "Rabbi hab li hukman wa alhiqni bil-salihin.",
    "english": "My Lord, grant me sound judgment and join me with the righteous.",
    "turkish": "Rabbim! Bana hikmet ver ve beni salihlerle birlikte kıl.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "knowledge"
    ],
    "context": "Ibrahim asked for wisdom and companionship with the righteous.",
    "reflection": "Seek Allah’s guidance and righteous company for a steady path.",
    "sources": [
      "https://quran.com/26/83",
      "https://tanzil.net/#26:83"
    ]
  },
  {
    "id": "ibrahim-26-84",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "26:84"
    },
    "arabic": "وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ",
    "transliteration": "Waj'al li lisan sidqin fi al-akhirin.",
    "english": "Grant me a truthful reputation among later generations.",
    "turkish": "Sonraki nesiller arasında benim için doğru bir ün nasip et.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "gratitude"
    ],
    "context": "Ibrahim asked Allah for a lasting, truthful legacy.",
    "reflection": "A good name comes from sincerity and Allah’s acceptance.",
    "sources": [
      "https://quran.com/26/84",
      "https://tanzil.net/#26:84"
    ]
  },
  {
    "id": "ibrahim-26-85",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "26:85"
    },
    "arabic": "وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ",
    "transliteration": "Waj'alni min warathati jannat al-na'im.",
    "english": "Make me among the heirs of the Garden of Bliss.",
    "turkish": "Beni nimet cennetinin mirasçılarından eyle.",
    "translation_note": "Paraphrase",
    "topics": [
      "mercy",
      "guidance"
    ],
    "context": "Ibrahim asked to be counted among those who inherit Paradise.",
    "reflection": "We should ask Allah for a hopeful end in the Hereafter.",
    "sources": [
      "https://quran.com/26/85",
      "https://tanzil.net/#26:85"
    ]
  },
  {
    "id": "ibrahim-26-86",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "26:86"
    },
    "arabic": "وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ",
    "transliteration": "Waghfir li abi innahu kana mina al-dallin.",
    "english": "Forgive my father; he was among those who went astray.",
    "turkish": "Babamı bağışla; o sapkınlardan olmuştu.",
    "translation_note": "Paraphrase",
    "topics": [
      "forgiveness",
      "family"
    ],
    "context": "Ibrahim prayed for his father before knowing his final fate.",
    "reflection": "We can ask Allah to guide and forgive our families with compassion.",
    "sources": [
      "https://quran.com/26/86",
      "https://tanzil.net/#26:86"
    ]
  },
  {
    "id": "ibrahim-26-87",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "26:87"
    },
    "arabic": "وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ",
    "transliteration": "Wa la tukhzini yawma yub'athun.",
    "english": "Do not disgrace me on the Day they are resurrected.",
    "turkish": "Diriltilecekleri gün beni mahcup etme.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "mercy"
    ],
    "context": "Ibrahim sought protection from humiliation on the Day of Resurrection.",
    "reflection": "We should pray for honor and safety in the Hereafter.",
    "sources": [
      "https://quran.com/26/87",
      "https://tanzil.net/#26:87"
    ]
  },
  {
    "id": "ibrahim-37-100",
    "prophet": {
      "ar": "إبراهيم",
      "en": "Abraham",
      "tr": "İbrahim"
    },
    "source": {
      "type": "Quran",
      "reference": "37:100"
    },
    "arabic": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ",
    "transliteration": "Rabbi hab li mina al-salihin.",
    "english": "My Lord, grant me a righteous child.",
    "turkish": "Rabbim! Bana salih bir evlat bağışla.",
    "translation_note": "Paraphrase",
    "topics": [
      "family",
      "guidance"
    ],
    "context": "Ibrahim asked Allah for a righteous child.",
    "reflection": "Righteous offspring are a blessing and a responsibility.",
    "sources": [
      "https://quran.com/37/100",
      "https://tanzil.net/#37:100"
    ]
  },
  {
    "id": "musa-20-25",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "20:25"
    },
    "arabic": "رَبِّ اشْرَحْ لِي صَدْرِي",
    "transliteration": "Rabbi ishrah li sadri.",
    "english": "My Lord, expand my chest for me.",
    "turkish": "Rabbim! Gönlümü genişlet.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "sabr"
    ],
    "context": "Musa asked Allah for inner strength before confronting Pharaoh.",
    "reflection": "We need Allah’s support to face daunting tasks.",
    "sources": [
      "https://quran.com/20/25",
      "https://tanzil.net/#20:25"
    ]
  },
  {
    "id": "musa-20-26",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "20:26"
    },
    "arabic": "وَيَسِّرْ لِي أَمْرِي",
    "transliteration": "Wa yassir li amri.",
    "english": "Make my task easy for me.",
    "turkish": "İşimi bana kolaylaştır.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "sabr"
    ],
    "context": "Musa asked for ease in carrying out his mission.",
    "reflection": "Ask Allah to ease difficult responsibilities.",
    "sources": [
      "https://quran.com/20/26",
      "https://tanzil.net/#20:26"
    ]
  },
  {
    "id": "musa-20-27",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "20:27"
    },
    "arabic": "وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي",
    "transliteration": "Wahlul 'uqdatan min lisani.",
    "english": "Untie the knot from my tongue.",
    "turkish": "Dilimin düğümünü çöz.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "knowledge"
    ],
    "context": "Musa asked Allah to grant him clarity in speech.",
    "reflection": "Clear speech is a gift that comes from Allah.",
    "sources": [
      "https://quran.com/20/27",
      "https://tanzil.net/#20:27"
    ]
  },
  {
    "id": "musa-20-28",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "20:28"
    },
    "arabic": "يَفْقَهُوا قَوْلِي",
    "transliteration": "Yafqahu qawli.",
    "english": "So they may understand my speech.",
    "turkish": "Sözümü anlasınlar.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "knowledge"
    ],
    "context": "Musa wanted his message to be understood clearly.",
    "reflection": "Effective communication is part of conveying truth.",
    "sources": [
      "https://quran.com/20/28",
      "https://tanzil.net/#20:28"
    ]
  },
  {
    "id": "musa-7-151",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "7:151"
    },
    "arabic": "قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
    "transliteration": "Rabbi ighfir li wa li akhi wa adkhilna fi rahmatika wa anta arham al-rahimin.",
    "english": "My Lord, forgive me and my brother and admit us into Your mercy; You are the most merciful of the merciful.",
    "turkish": "Rabbim! Beni ve kardeşimi bağışla; bizi rahmetine dahil et. Sen merhametlilerin en merhametlisisin.",
    "translation_note": "Paraphrase",
    "topics": [
      "forgiveness",
      "mercy",
      "family"
    ],
    "context": "Musa sought forgiveness and mercy for himself and Harun.",
    "reflection": "We can ask Allah to cover our family with His mercy.",
    "sources": [
      "https://quran.com/7/151",
      "https://tanzil.net/#7:151"
    ]
  },
  {
    "id": "musa-7-156",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "7:156"
    },
    "arabic": "وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ",
    "transliteration": "Waktub lana fi hadhihi al-dunya hasanatan wa fi al-akhirati inna hudna ilayk.",
    "english": "Decree for us goodness in this world and in the Hereafter; we have turned to You.",
    "turkish": "Bu dünyada da ahirette de bize güzellik yaz; biz Sana yöneldik.",
    "translation_note": "Paraphrase",
    "topics": [
      "tawbah",
      "guidance",
      "mercy"
    ],
    "context": "Musa asked for goodness in both worlds after turning back to Allah.",
    "reflection": "Repentance should be paired with seeking lasting goodness in both worlds.",
    "sources": [
      "https://quran.com/7/156",
      "https://tanzil.net/#7:156"
    ]
  },
  {
    "id": "musa-28-16",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "28:16"
    },
    "arabic": "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
    "transliteration": "Rabbi inni zalamtu nafsi faghfir li faghafara lahu innahu huwa al-ghafur al-rahim.",
    "english": "My Lord, I have wronged myself, so forgive me. And He forgave him; indeed He is the Most Forgiving, Most Merciful.",
    "turkish": "Rabbim! Kendime zulmettim, beni bağışla. Allah onu bağışladı; şüphesiz O çok bağışlayan, çok merhamet edendir.",
    "translation_note": "Paraphrase",
    "topics": [
      "tawbah",
      "forgiveness",
      "mercy"
    ],
    "context": "After his mistake in Egypt, Musa sought Allah’s forgiveness.",
    "reflection": "Immediate repentance opens the door to Allah’s mercy.",
    "sources": [
      "https://quran.com/28/16",
      "https://tanzil.net/#28:16"
    ]
  },
  {
    "id": "musa-28-21",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "28:21"
    },
    "arabic": "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
    "transliteration": "Rabbi najjini mina al-qawmi al-zalimin.",
    "english": "My Lord, save me from the wrongdoing people.",
    "turkish": "Rabbim! Beni zalim topluluktan kurtar.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "justice"
    ],
    "context": "Musa prayed for safety as he fled oppression.",
    "reflection": "In danger, we can ask Allah for rescue and protection.",
    "sources": [
      "https://quran.com/28/21",
      "https://tanzil.net/#28:21"
    ]
  },
  {
    "id": "musa-28-24",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "28:24"
    },
    "arabic": "رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
    "transliteration": "Rabbi inni lima anzalta ilayya min khayrin faqir.",
    "english": "My Lord, I am truly in need of any good You send down to me.",
    "turkish": "Rabbim! Bana indireceğin her türlü hayra muhtacım.",
    "translation_note": "Paraphrase",
    "topics": [
      "rizq",
      "mercy"
    ],
    "context": "Musa asked Allah for provision when he was alone and in need.",
    "reflection": "We should openly acknowledge our dependence on Allah’s provision.",
    "sources": [
      "https://quran.com/28/24",
      "https://tanzil.net/#28:24"
    ]
  },
  {
    "id": "musa-10-88",
    "prophet": {
      "ar": "موسى",
      "en": "Moses",
      "tr": "Musa"
    },
    "source": {
      "type": "Quran",
      "reference": "10:88"
    },
    "arabic": "رَبَّنَا إِنَّكَ آتَيْتَ فِرْعَوْنَ وَمَلَأَهُ زِينَةً وَأَمْوَالًا فِي الْحَيَاةِ الدُّنْيَا رَبَّنَا لِيُضِلُّوا عَن سَبِيلِكَ رَبَّنَا اطْمِسْ عَلَىٰ أَمْوَالِهِمْ وَاشْدُدْ عَلَىٰ قُلُوبِهِمْ فَلَا يُؤْمِنُوا حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ",
    "transliteration": "Rabbana innaka atayta fir'awna wa mala'ahu zinatan wa amwalan fi al-hayat al-dunya rabbana liyudillu 'an sabilika rabbana itmis 'ala amwalihim wa ushdud 'ala qulubihim fala yu'minu hatta yaraw al-'adhab al-alim.",
    "english": "Our Lord, You have given Pharaoh and his chiefs splendor and wealth in worldly life so they mislead from Your way. Our Lord, obliterate their wealth and harden their hearts so they will not believe until they see the painful punishment.",
    "turkish": "Rabbimiz! Firavun’a ve ileri gelenlerine dünya hayatında süs ve mal verdin; böylece Senin yolundan saptırıyorlar. Rabbimiz! Mallarını yok et, kalplerini sıkılaştır ki acı azabı görmedikçe iman etmesinler.",
    "translation_note": "Paraphrase",
    "topics": [
      "justice",
      "protection"
    ],
    "context": "Musa and Harun asked Allah to stop Pharaoh’s oppression and misguidance.",
    "reflection": "We can ask Allah to restrain injustice and protect people from wrongdoing.",
    "sources": [
      "https://quran.com/10/88",
      "https://tanzil.net/#10:88"
    ]
  },
  {
    "id": "yunus-21-87",
    "prophet": {
      "ar": "يونس",
      "en": "Jonah",
      "tr": "Yunus"
    },
    "source": {
      "type": "Quran",
      "reference": "21:87"
    },
    "arabic": "فَنَادَىٰ فِي الظُّلُمَاتِ أَن لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "transliteration": "La ilaha illa anta subhanaka inni kuntu mina al-zalimin.",
    "english": "There is no god but You; exalted are You. I was indeed among the wrongdoers.",
    "turkish": "Senden başka ilah yok; Seni her türlü eksiklikten tenzih ederim. Ben zalimlerden oldum.",
    "translation_note": "Paraphrase",
    "topics": [
      "tawbah",
      "mercy",
      "distress"
    ],
    "context": "Yunus called on Allah from the darkness, admitting his mistake.",
    "reflection": "Even in deep distress, repentance and tawhid bring relief.",
    "sources": [
      "https://quran.com/21/87",
      "https://tanzil.net/#21:87"
    ]
  },
  {
    "id": "ayyub-21-83",
    "prophet": {
      "ar": "أيوب",
      "en": "Job",
      "tr": "Eyüp"
    },
    "source": {
      "type": "Quran",
      "reference": "21:83"
    },
    "arabic": "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
    "transliteration": "Anni massaniya al-durru wa anta arham al-rahimin.",
    "english": "Adversity has touched me, and You are the most merciful of the merciful.",
    "turkish": "Bana sıkıntı dokundu; Sen merhametlilerin en merhametlisisin.",
    "translation_note": "Paraphrase",
    "topics": [
      "healing",
      "mercy",
      "distress"
    ],
    "context": "Ayyub called upon Allah during severe illness.",
    "reflection": "We can seek healing while affirming Allah’s mercy.",
    "sources": [
      "https://quran.com/21/83",
      "https://tanzil.net/#21:83"
    ]
  },
  {
    "id": "ayyub-38-41",
    "prophet": {
      "ar": "أيوب",
      "en": "Job",
      "tr": "Eyüp"
    },
    "source": {
      "type": "Quran",
      "reference": "38:41"
    },
    "arabic": "رَبِّ إِنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ",
    "transliteration": "Rabbi inni massaniya al-shaytanu binusbin wa 'adhab.",
    "english": "My Lord, Satan has touched me with hardship and suffering.",
    "turkish": "Rabbim! Şeytan bana yorgunluk ve azap dokundurdu.",
    "translation_note": "Paraphrase",
    "topics": [
      "distress",
      "healing",
      "protection"
    ],
    "context": "Ayyub described his suffering and turned to Allah for relief.",
    "reflection": "We may describe our hardship to Allah while seeking His protection.",
    "sources": [
      "https://quran.com/38/41",
      "https://tanzil.net/#38:41"
    ]
  },
  {
    "id": "zakariya-3-38",
    "prophet": {
      "ar": "زكريا",
      "en": "Zechariah",
      "tr": "Zekeriya"
    },
    "source": {
      "type": "Quran",
      "reference": "3:38"
    },
    "arabic": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ",
    "transliteration": "Rabbi hab li min ladunka dhurriyyatan tayyibatan innaka sami'u al-du'a.",
    "english": "My Lord, grant me from Yourself a good offspring. You are the Hearer of supplication.",
    "turkish": "Rabbim! Bana katından temiz bir nesil bağışla; Sen duayı işitensin.",
    "translation_note": "Paraphrase",
    "topics": [
      "family",
      "mercy"
    ],
    "context": "Zakariya prayed for righteous offspring despite old age.",
    "reflection": "Allah hears every sincere prayer, even against the odds.",
    "sources": [
      "https://quran.com/3/38",
      "https://tanzil.net/#3:38"
    ]
  },
  {
    "id": "zakariya-19-5",
    "prophet": {
      "ar": "زكريا",
      "en": "Zechariah",
      "tr": "Zekeriya"
    },
    "source": {
      "type": "Quran",
      "reference": "19:5"
    },
    "arabic": "فَهَبْ لِي مِن لَّدُنكَ وَلِيًّا",
    "transliteration": "Fahab li min ladunka waliyyan.",
    "english": "So grant me from Yourself an heir.",
    "turkish": "Katından bana bir veli bağışla.",
    "translation_note": "Paraphrase",
    "topics": [
      "family",
      "mercy"
    ],
    "context": "Zakariya asked for a righteous successor to carry the message.",
    "reflection": "We can ask Allah to provide successors who keep faith alive.",
    "sources": [
      "https://quran.com/19/5",
      "https://tanzil.net/#19:5"
    ]
  },
  {
    "id": "zakariya-21-89",
    "prophet": {
      "ar": "زكريا",
      "en": "Zechariah",
      "tr": "Zekeriya"
    },
    "source": {
      "type": "Quran",
      "reference": "21:89"
    },
    "arabic": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
    "transliteration": "Rabbi la tadharni fardan wa anta khayru al-warithin.",
    "english": "My Lord, do not leave me without an heir; You are the best of inheritors.",
    "turkish": "Rabbim! Beni tek başıma bırakma; Sen varislerin en hayırlısısın.",
    "translation_note": "Paraphrase",
    "topics": [
      "family",
      "mercy"
    ],
    "context": "Zakariya asked for a child and trusted Allah’s wisdom.",
    "reflection": "Hope in Allah remains even when reasons seem far.",
    "sources": [
      "https://quran.com/21/89",
      "https://tanzil.net/#21:89"
    ]
  },
  {
    "id": "yusuf-12-101",
    "prophet": {
      "ar": "يوسف",
      "en": "Joseph",
      "tr": "Yusuf"
    },
    "source": {
      "type": "Quran",
      "reference": "12:101"
    },
    "arabic": "رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
    "transliteration": "Rabbi qad ataytani mina al-mulk wa 'allamtani min ta'wil al-ahadith fatir al-samawati wal-ard anta waliyyi fi al-dunya wal-akhirah tawaffani musliman wa alhiqni bil-salihin.",
    "english": "My Lord, You have granted me authority and taught me interpretation. Creator of the heavens and earth, You are my Protector in this world and the Hereafter. Let me die as a Muslim and join me with the righteous.",
    "turkish": "Rabbim! Bana hüküm verdin ve rüya yorumunu öğrettin. Göklerin ve yerin yaratıcısı! Dünyada da ahirette de dostum Sensin. Beni Müslüman olarak vefat ettir ve beni salihlerle birlikte kıl.",
    "translation_note": "Paraphrase",
    "topics": [
      "gratitude",
      "guidance",
      "mercy"
    ],
    "context": "Yusuf thanked Allah for his gifts and prayed for a faithful end.",
    "reflection": "Blessings should lead us to seek a righteous conclusion.",
    "sources": [
      "https://quran.com/12/101",
      "https://tanzil.net/#12:101"
    ]
  },
  {
    "id": "sulaiman-27-19",
    "prophet": {
      "ar": "سليمان",
      "en": "Solomon",
      "tr": "Süleyman"
    },
    "source": {
      "type": "Quran",
      "reference": "27:19"
    },
    "arabic": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
    "transliteration": "Rabbi awzi'ni an ashkura ni'mataka allati an'amta 'alayya wa 'ala walidayya wa an a'mala salihan tardah wa aslih li fi dhurriyyati inni tubtu ilayka wa inni mina al-muslimin.",
    "english": "My Lord, enable me to be grateful for Your favor upon me and my parents, and to do righteous deeds that please You. Set my offspring right; I turn to You, and I am among the Muslims.",
    "turkish": "Rabbim! Bana ve anne babama verdiğin nimetlere şükretmeyi ve razı olacağın salih ameller yapmayı nasip et. Soyumu ıslah et. Sana yöneldim ve Müslümanlardanım.",
    "translation_note": "Paraphrase",
    "topics": [
      "gratitude",
      "family",
      "guidance"
    ],
    "context": "Sulaiman thanked Allah and asked for righteous deeds and offspring.",
    "reflection": "Gratitude grows when it is paired with righteous action.",
    "sources": [
      "https://quran.com/27/19",
      "https://tanzil.net/#27:19"
    ]
  },
  {
    "id": "sulaiman-38-35",
    "prophet": {
      "ar": "سليمان",
      "en": "Solomon",
      "tr": "Süleyman"
    },
    "source": {
      "type": "Quran",
      "reference": "38:35"
    },
    "arabic": "رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي إِنَّكَ أَنتَ الْوَهَّابُ",
    "transliteration": "Rabbi ighfir li wa hab li mulkan la yanbaghi li ahadin min ba'di innaka anta al-wahhab.",
    "english": "My Lord, forgive me and grant me a kingdom that none after me will have. You are the Bestower.",
    "turkish": "Rabbim! Beni bağışla ve benden sonra kimseye verilmeyecek bir hüküm ver. Sen çok vericisin.",
    "translation_note": "Paraphrase",
    "topics": [
      "forgiveness",
      "gratitude"
    ],
    "context": "Sulaiman sought forgiveness and a unique kingdom by Allah’s gift.",
    "reflection": "Even power is a gift that should be requested with humility.",
    "sources": [
      "https://quran.com/38/35",
      "https://tanzil.net/#38:35"
    ]
  },
  {
    "id": "isa-5-114",
    "prophet": {
      "ar": "عيسى",
      "en": "Jesus",
      "tr": "İsa"
    },
    "source": {
      "type": "Quran",
      "reference": "5:114"
    },
    "arabic": "اللَّهُمَّ رَبَّنَا أَنزِلْ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ",
    "transliteration": "Allahumma rabbana anzil 'alayna ma'idatan mina al-sama'i takunu lana 'idan li-awwalina wa akhirina wa ayatan minka warzuqna wa anta khayru al-raziqin.",
    "english": "O Allah, our Lord, send down to us a table from heaven to be a festival for the first and last of us and a sign from You. Provide for us; You are the best of providers.",
    "turkish": "Allah’ım, Rabbimiz! Gökten bize bir sofra indir; bize bayram olsun ve Senden bir ayet olsun. Bizi rızıklandır; Sen rızık verenlerin en hayırlısısın.",
    "translation_note": "Paraphrase",
    "topics": [
      "rizq",
      "gratitude",
      "mercy"
    ],
    "context": "Isa asked Allah for a heavenly table as a sign and provision.",
    "reflection": "We should see Allah’s provision as a sign of His care.",
    "sources": [
      "https://quran.com/5/114",
      "https://tanzil.net/#5:114"
    ]
  },
  {
    "id": "lut-26-169",
    "prophet": {
      "ar": "لوط",
      "en": "Lot",
      "tr": "Lut"
    },
    "source": {
      "type": "Quran",
      "reference": "26:169"
    },
    "arabic": "رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ",
    "transliteration": "Rabbi najjini wa ahli mimma ya'malun.",
    "english": "My Lord, save me and my family from what they do.",
    "turkish": "Rabbim! Beni ve ailemi onların yaptıklarından kurtar.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "family"
    ],
    "context": "Lut asked Allah to rescue him and his family from a corrupt society.",
    "reflection": "We can ask Allah to protect our families from harmful environments.",
    "sources": [
      "https://quran.com/26/169",
      "https://tanzil.net/#26:169"
    ]
  },
  {
    "id": "muhammad-bukhari-834",
    "prophet": {
      "ar": "محمد",
      "en": "Muhammad",
      "tr": "Muhammed"
    },
    "source": {
      "type": "Hadith",
      "reference": "Bukhari 834",
      "book": "Sahih al-Bukhari",
      "grade": "Sahih"
    },
    "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
    "transliteration": "Allahumma inni zalamtu nafsi zulman kathiran wa la yaghfiru al-dhunuba illa anta faghfir li maghfiratan min 'indika warhamni innaka anta al-ghafur al-rahim.",
    "english": "O Allah, I have greatly wronged myself, and none forgives sins except You. Forgive me and have mercy on me; You are the Most Forgiving, Most Merciful.",
    "turkish": "Allah’ım! Kendime çok zulmettim; günahları ancak Sen bağışlarsın. Beni bağışla ve bana merhamet et; Sen çok bağışlayan, çok merhamet edensin.",
    "translation_note": "Paraphrase",
    "topics": [
      "tawbah",
      "forgiveness",
      "mercy"
    ],
    "context": "The Prophet taught this supplication to seek forgiveness and mercy.",
    "reflection": "Sincere repentance recognizes that only Allah can forgive sins.",
    "sources": [
      "https://sunnah.com/bukhari:834"
    ]
  },
  {
    "id": "muhammad-muslim-843",
    "prophet": {
      "ar": "محمد",
      "en": "Muhammad",
      "tr": "Muhammed"
    },
    "source": {
      "type": "Hadith",
      "reference": "Muslim 843",
      "book": "Sahih Muslim",
      "grade": "Sahih"
    },
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
    "transliteration": "Allahumma inni a'udhu bika min 'adhabi jahannam wa min 'adhabi al-qabr wa min fitnati al-mahya wal-mamat wa min sharri fitnati al-masih al-dajjal.",
    "english": "O Allah, I seek refuge in You from the punishment of Hell, the punishment of the grave, the trials of life and death, and the evil of the Antichrist.",
    "turkish": "Allah’ım! Cehennem azabından, kabir azabından, hayat ve ölüm fitnelerinden ve Deccal fitnesinin şerrinden Sana sığınırım.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection"
    ],
    "context": "The Prophet taught this supplication for protection from major trials and punishments.",
    "reflection": "We seek Allah’s protection from both worldly and end-time trials.",
    "sources": [
      "https://sunnah.com/muslim:843"
    ]
  },
  {
    "id": "muhammad-muslim-2720",
    "prophet": {
      "ar": "محمد",
      "en": "Muhammad",
      "tr": "Muhammed"
    },
    "source": {
      "type": "Hadith",
      "reference": "Muslim 2720",
      "book": "Sahih Muslim",
      "grade": "Sahih"
    },
    "arabic": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي وَأَصْلِحْ لِي آخِرَتِيَ الَّتِي فِيهَا مَعَادِي",
    "transliteration": "Allahumma aslih li diniya alladhi huwa 'ismatu amri wa aslih li dunyaya allati fiha ma'ashi wa aslih li akhirati allati fiha ma'adi.",
    "english": "O Allah, set right for me my religion which safeguards my affairs, set right for me my worldly life in which is my living, and set right for me my Hereafter to which is my return.",
    "turkish": "Allah’ım! İşlerimin teminatı olan dinimi düzelt; geçimimin olduğu dünyamı düzelt; dönüşümün olduğu ahiretimi de düzelt.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "mercy"
    ],
    "context": "The Prophet taught a comprehensive prayer for faith, worldly life, and the Hereafter.",
    "reflection": "Balance our needs by asking Allah to rectify all aspects of life.",
    "sources": [
      "https://sunnah.com/muslim:2720"
    ]
  },
  {
    "id": "muhammad-muslim-2721",
    "prophet": {
      "ar": "محمد",
      "en": "Muhammad",
      "tr": "Muhammed"
    },
    "source": {
      "type": "Hadith",
      "reference": "Muslim 2721",
      "book": "Sahih Muslim",
      "grade": "Sahih"
    },
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
    "transliteration": "Allahumma inni as'aluka al-huda wa al-tuqa wa al-'afaf wa al-ghina.",
    "english": "O Allah, I ask You for guidance, piety, chastity, and contentment.",
    "turkish": "Allah’ım! Senden hidayet, takva, iffet ve gönül zenginliği dilerim.",
    "translation_note": "Paraphrase",
    "topics": [
      "guidance",
      "mercy"
    ],
    "context": "The Prophet asked Allah for inner virtues and contentment.",
    "reflection": "True richness is guidance and contentment granted by Allah.",
    "sources": [
      "https://sunnah.com/muslim:2721"
    ]
  },
  {
    "id": "muhammad-bukhari-6369",
    "prophet": {
      "ar": "محمد",
      "en": "Muhammad",
      "tr": "Muhammed"
    },
    "source": {
      "type": "Hadith",
      "reference": "Bukhari 6369",
      "book": "Sahih al-Bukhari",
      "grade": "Sahih"
    },
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
    "transliteration": "Allahumma inni a'udhu bika min al-hamm wal-hazan wal-'ajz wal-kasal wal-bukhl wal-jubn wa dala' al-dayn wa ghalabat al-rijal.",
    "english": "O Allah, I seek refuge in You from anxiety and grief, incapacity and laziness, miserliness and cowardice, the burden of debt, and being overpowered by people.",
    "turkish": "Allah’ım! Hüzün ve kederden, acizlik ve tembellikten, cimrilik ve korkaklıktan, borç yükünden ve insanların baskısından Sana sığınırım.",
    "translation_note": "Paraphrase",
    "topics": [
      "protection",
      "distress"
    ],
    "context": "The Prophet taught this for seeking protection from common hardships.",
    "reflection": "Seek Allah’s refuge from inner and outer pressures.",
    "sources": [
      "https://sunnah.com/bukhari:6369"
    ]
  }
]
